{
  "courses": [
    {
      "key": "adventure1",
      "level": "Adventure I",
      "title": "Stretch your wings",
      "tasks": [
        {
          "level": "Task 1",
          "key": "task1",
          "title": "Your first flight",
          "summary": "Single movement command",
          "description": "We'll start with the most basic movement, drag in a \"fly\" clause and add a movement command to it. See how you can move in different directions, for different amounts of time. Try it out in the simulator to see how it makes the drone fly!",
          "environments": []
        },
        {
          "level": "Task 2",
          "key": "task2",
          "title": "Flying further",
          "summary": "Multiple movement commands",
          "description": "Try to click together multiple movement commands within the fly clause. Each command has its own direction and duration. You'll notice that when your program gets run on the simulator, the commands are run one after another, starting at the top. For a challenge try to make the drone fly in a square, finishing at the same position it starts.",
          "environments": []
        },
        {
          "level": "Task 3",
          "key": "task3",
          "title": "Twisting and turning",
          "summary": "Movement AND rotation commands",
          "description": "Now we're comfortable with moving the drone, we've added some rotation commands. There's seperate commands for rotating left and right, and we can see the angle that we rotate relative to the front of the drone. Try flying in a square again, but this time using only forward movement and rotation commands.",
          "environments": []
        }
      ]
    },
    {
      "key": "adventure2",
      "level": "Adventure II",
      "title": "Flying into action",
      "tasks": [
        {
          "key": "task1",
          "level": "Task 1",
          "title": "🔥FIRE!!🔥",
          "summary": "Fly to fire station at (3m, 2m).",
          "description": "A wildfire has started nearby! All the fire and rescue helicopters are being repaired so the local fire department have asked for our help. First things first, we need to fly to the fire station that`s 3 miles north, 2 miles east. Remember the drone starts facing northwards, and 1 metre in our scale model is 1 mile in the real world.",
          "environments": [
            {
              "object": "house",
              "position": {
                "x": 300,
                "y": 200
              }
            }
          ]
        },
        {
          "key": "task2",
          "level": "Task 2",
          "title": "🆘 Help!",
          "summary": "Fly to the farms at (3, -1), (-1, 2) and (-2, -2).",
          "description": "The firefighters tell us that there are 3 farms where people need help. The drone has been loaded with 3 rescue packages which can be dropped by making the drone do a full turn on the spot in either direction. First farm is 3 miles east, 1 mile south. The second is 1 mile west, 2 miles north, and the final farm is 2 miles south, 2 miles west. The order that the farms are visited doesn`t matter, as long as they get the help they need. Good luck!",
          "environments": [
            {
              "object": "house",
              "position": {
                "x": 300,
                "y": -100
              }
            },
            {
              "object": "house",
              "position": {
                "x": -100,
                "y": 200
              }
            },
            {
              "object": "house",
              "position": {
                "x": -200,
                "y": -200
              }
            }
          ]
        },
        {
          "key": "task3",
          "level": "Task 3",
          "title": "Save the warehouse!",
          "summary": "Fly along 2 `fires`, (-1, -1) to (-1, 1) and (-4, -2) to (-4, 2).",
          "description": "The firefighters have modified the drone so that it can release water to combat the fire. And just in time too, as there are 2 fires approaching the warehouse to the west. The first is 1 mile east of it and is 2 miles long, while the second is 2 miles west and is 4 miles long (look in your simulator for more details). The warehouse itself is 2 miles west of the fire station (where the drone starts).",
          "environments": [
            {
              "object": "fireStation",
              "position": {
                "x": -200,
                "y": 0
              }
            },
            {
              "object": "fire",
              "position": {
                "x": -100,
                "y": 200
              }
            },
            {
              "object": "fire",
              "position": {
                "x": -200,
                "y": -200
              }
            }
          ]
        }
      ]
    }
  ]
}
